Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ནུབ་ཐམས་ཅད་དུ་བགྱིས་ན། བརྒྱ་བྱིན་ལ་སོགས་པ་སུམ་ཅུ་རྩ་གསུམ་རིས་ཀྱི་ལྷ་རྣམས་དང་། ལྷའི་བུ་མོའི་ཚོགས་ཐམས་ཅད་དང་གཙང་མའི་ལྷའི་བུ་མོ་ཐམས་ཅད་བབས་ནས་དབང་དུ་འགྱུར་ཏེ།
en: If the vidyā holder practices it every night, the gods of the realm of Thirty-Three, headed by Śakra, and all apsarases and beautiful celestial girls will arrive and remain in the vidyā holder’s thrall.

source: ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་བགྱིད་ཅིང་མཆིས་པར་འགྱུར་རོ།
en: They will attend upon him for as long as they live. “

source: །ཟླ་བ་ཉ་ནས་བརྩམས་ཏེ་མར་གྱི་ངོའི་ཚེས་ཉི་ཤུ་གསུམ་མམ་གནམ་སྟོང་གི་བར་དུ་དུས་གསུམ་དུ་ལན་ཉི་ཤུ་རྩ་གཅིག་སྦྱིན་སྲེག་བགྱིས་ལ།
en: Alternatively, the vidyā holder should commence the rite on the day of the full moon and continue until the eighth or fifteenth day, making the homa offering twenty-one times at the three junctions of the day.

source: ཨརྐའི་ཤིང་གི་ཡམ་སྲེག་ཤིང་གིས་མེ་སྦར་ནས་གནམ་སྟོང་གིས་རྫོགས་པ་དང་།
en: On the fifteenth day, he should make a fire with the sticks of giant milkweed.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་གི་གཟུགས་ཀྱིས་མདུན་དུ་མཆིས་ནས། རིག་སྔགས་འཆང་ལེགས་སོ་ཞེས་བགྱི་བ་སྩོལ་བར་འགྱུར་ཏེ། རིག་སྔགས་འཆང་ལེགས་སོ་ལེགས་སོ། །ང་མཉེས་པར་བྱས་ཀྱིས།
en: Noble Avalokiteśvara will appear before the vidyā holder in person and will applaud him, saying, ‘Good!

source: རིག་སྔགས་འཆང་སྨྲོས་ཤིག་དང་། མཆོག་སྦྱིན་ཏེ་གང་གཉེར་བ་དེ་ཐམས་ཅད་སྦྱིན་ནོ།
en: Good, vidyā holder!

source: །གཏེར་སྨྲ་བའམ།
en: I am pleased with you.

source: ནོར་བསྒྱུར་བར་སྨྲ་བའམ།
en: Ask for a boon and I will grant it.

source: ཞིང་སྨྲ་བའམ། ནམ་མཁའ་ལ་འགྲོ་བའམ། མི་སྣང་བར་བྱ་བའམ། གསང་སྔགས་སྨྲ་བའམ། ཆོ་ག་ཞིབ་མོ་འགྲུབ་པ་དེ་དག་ཐམས་ཅད་སྦྱིན་ནོ། །རྒྱལ་བོ་ཉིད་དམ། བློན་པོ་ཉིད་དམ། ཡུལ་བདག་ཉིད་དམ། ཕྱུག་པ་ཉིད་དམ།
en: I will grant all that you desire, whether it is the ability to find treasure, skill in the alchemical arts, knowledge of agriculture, the ability to travel through space, the ability to become invisible, ability in mantra, or success in ritual activity—I will grant it all.

source: གྲོང་རྡལ་འཐོབ་པའམ། གོས་འཐོབ་པའམ། བ་ལང་དང་། རྟ་དང་། མ་ཧེ་དང་།
en: I can grant the position of the king or a minister, the powers of speech, villages, clothes, cows, horses, buffalo, camels, and other animals.

source: རྔ་མོ་དང་། ལུག་འཐོབ་པའམ། ནོར་འཐོབ་པའམ།
en: I can also grant money and grain.

source: འབྲུ་འཐོབ་པ་དེ་དག་ཐམས་ཅད་སྦྱིན་ནོ། །ནམ་མཁའ་ལ་འགྲོ་བའམ། མི་སྣང་བར་བྱ་བའམ། རྫུ་འཕྲུལ་འཐོབ་པའམ། ཏིང་ངེ་འཛིན་འཐོབ་པའམ།
en: I can grant everything—sky travel, invisibility, magical powers, samādhi, dhāraṇī, the accomplishment of rites involving mudrās and maṇḍalas, the power to animate corpses by summoning vetālas, the state of a siddhi vidyādhara, strong-arm vidyādhara and space vidyādhara, the ability to find openings in the ground, and the power to enter forests, mountains, or cemeteries.

source: གཟུངས་འཐོབ་པའམ། ཕྱག་རྒྱ་དང་དཀྱིལ་འཁོར་གྱི་ཆོ་ག་ཞིབ་མོ་བསྒྲུབ་པ་དང་རོ་ལངས་བསླངས་པའམ། རིག་འཛིན་སྒྲུབ་པ་ཉིད་དམ། རལ་གྲིའི་རིག་འཛིན་ཉིད་དམ། ནམ་མཁའི་རིག་འཛིན་ཉིད་དམ། ཕུག་ཏུ་འཇུག་པའམ། དུར་ཁྲོད་དུ་འཇུག་པའམ། ནགས་སུ་འཇུག་པའམ།
en: I can grant all of this.’ “

source: རིལ་རྒྱུ་བ་དེ་དག་ཐམས་ཅད་སྦྱིན་ནོ། །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཇི་ལྟར་ཡིད་ལ་བསམས་ཤིང་སྨྲས་པ་དེ་དག་ཐམས་ཅད་སྩོལ་བར་བགྱིད་དོ།
en: The vidyā holder should then state his wishes, and all will be granted.

source: །རིག་སྔགས་འཆང་ལ་བསྟན་པ་ཙམ་གྱི་མོད་ལ་དྲི་མེད་དོན་ཡོད་ལྟ་བ་ཞེས་བགྱི་བ་ལུས་ཡོངས་སུ་དག་པ་འཐོབ་པར་འགྱུར་རོ།
en: Through the mere act of seeing, his body will be purified in a manner known by the name stainless amogha gaze.

source: །ཚེ་བརྗེས་ནས་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་དུ་སྐྱེ་བར་འགྱུར་ཏེ། པདྨ་ཟེ་བའི་དབུས་ནས་རྫུས་ཏེ་པདྨ་ལས་སྐྱེས་ནས་སྐྱེ་བའི་སྐྱེ་བ་དྲན་པར་འགྱུར་རོ།
en: Upon his death, he will go to the realm of Sukhāvatī, where he will be spontaneously born from the pericarp of a lotus flower and will retain his memories from each of his rebirths.

source: །དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བགྱིས་པ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་ཕྱག་རྒྱ་དང་། དཀྱིལ་འཁོར་རིམ་པར་དབྱེ་བ་དང་བཅས་པ། ཆོ་ག་ཞིབ་མོ་མཐའ་དག་དང་བཅས་པ་འདི་རྫོགས་ཏེ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐུག་གི་བར་དུ་ཁ་ཏོན་དུ་གནས་པར་བགྱིའོ།
en: This heart essence of Amoghapāśa honored by all the bodhisattvas, this maṇḍala of liberation complete with its rites and the collections of mudrās and mantras, will remain prominent in his memory until he attains complete and final awakening. “

source: །དེ་ནས་ལ་དུའི་སྦྱིན་སྲེག་གི་ཆོ་ག་བསྒྲུབ་པར་འཚལ་ན། རིག་སྔགས་འཆང་དེས་ཁ་ཟས་ལ་ལ་དུ་སྟོང་རྩ་བརྒྱད་བགྱིས་ལ། དེ་ནས་རིག་སྔགས་འཆང་གིས་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིའོ།
en: If the vidyā holder wants to successfully perform the homa rite with modaka sweets, he should prepare one thousand and eight sweetmeats and recite the heart mantra of Amoghapāśa one thousand and eight times.

source: །དེ་ནས་ལེགས་པར་ཁྲུས་བགྱིས་ཏེ། གཙང་མས་གོས་གཙང་མ་བགོ་བར་བགྱིའོ། །དེ་ནས་ལ་དུ་མར་དང་བསྲེས་ཏེ་སྦྱིན་སྲེག་བགྱིའོ། །ཤིན་ཏུ་དྲི་ཞིམ་པོའི་ཤིང་གི་ཡམ་སྲེག་ཤིང་གིས་མེ་སྦར་བར་བགྱིའོ།
en: Then, ritually clean, bathed, and wearing clean clothes, he should offer the sweetmeats, mixed with ghee, into a burning fire made with sticks of fragrant wood.

source: །སྟོང་རྩ་བརྒྱད་ཚང་བ་དང་མེའི་དབུས་ནས་ཁྱེའུ་ཞིག་བྱུང་ནས་སྣོད་ལྷའི་ལ་དུས་བཀང་ནས་དབུལ་བར་བགྱིད་དོ།
en: When he has offered all one thousand and eight of them, a boy will appear in the middle of the fire, holding out a dish filled with divine sweetmeats.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཡུངས་ཀར་ལ་ལན་བདུན་བཟླས་ཏེ། ཁྱེའུ་དེའི་ལག་ཏུ་གཏོར་རོ།
en: At that point, the vidyā holder should sprinkle the boy with mustard seeds incanted seven times. “

source: །ཁྱེའུ་དེས་རིག་སྔགས་འཆང་ལ་སྨྲས་པ། རིག་སྔགས་འཆང་ཁྱོད་ཅི་ཞིག་དོན་དུ་གཉེར།
en: The boy will then say to the vidyā holder, ‘What do you request, vidyā holder?’

source: རིག་སྔགས་འཆང་གིས་འདོད་པ་ཐམས་ཅད་བྱིན་ཅིག་ཅེས་བརྗོད་པར་བགྱིའོ། །དེས་སྨྲས་པ། རིག་སྔགས་འཆང་སྣོད་ཀྱི་ལ་དུ་ཁྱེར་ཅིག་དང་།
en: The vidyā holder should reply, ‘Fulfill all my wishes!’

source: འདིས་ཁྱོད་ཀྱི་དགོས་པ་དཔག་ཏུ་མེད་པ་འགྲུབ་པར་འགྱུར་རོ།
en: The boy will say, ‘If you take this dish of sweetmeats, O vidyā holder, all your boundless activities will succeed.

source: །འདི་ནི་ཁྱོད་ཀྱི་བཅུད་ཀྱི་མཆོག་ཡིན་ནོ། །རིག་སྔགས་འཆང་ལོང་ཤིག །
en: This is the sublime elixir of longevity, vidyā holder.

source: འདི་ནི་ཁྱོད་ཀྱི་གྲུབ་པའི་མཆོག་ཡིན་ནོ།
en: Take it and you will gain the supreme accomplishment.’

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་སྣོད་གང་བ་དེ་བླངས་ཏེ། ཁྱེའུ་ལ་ཡང་ཁྱེད་ཀྱིས་ཁོ་བོའི་གྲོགས་གྱིས་ཤིག་ཅེས་བརྗོད་པར་བགྱིའོ།
en: The vidyā holder should take the full dish and say to the boy, ‘Please be my assistant!’

source: །ཁྱེའུ་ཡིས་སྨྲས་པ།
en: The boy will reply, ‘I will.

source: དགོས་པ་ཐམས་ཅད་སྒྲུབ་པའི་གྲོགས་བགྱིའོ།
en: As an assistant, I will succeed in any undertaking.

source: །རིག་སྔགས་འཆང་གང་གི་ཚེ་དགོས་པ་བྱུང་བ་དེའི་ཚེ། གུ་གུལ་དང་། ཙནྡན་ལྷན་ཅིག་བསྲེས་ལ་མར་དང་ཡུངས་ཀར་སྦྱར་ནས། དོན་ཡོད་ལྕགས་ཀྱུས་ལན་བདུན་བཟླས་ཏེ་སྦྱིན་སྲེག་བགྱིའོ། །ཨརྐའི་ཤིང་གི་མེ་སྦར་རོ།
en: Whenever you have a task to perform, you should offer a homa using sticks of giant milkweed for fuel and consisting of mustard seeds smeared with ghee, mixed with bdellium and sandalwood, and incanted seven times with the mantra of Amoghāṅkuśa.

source: །སྦྱིན་སྲེག་བགྱིས་པ་ཙམ་གྱི་མོད་ལ། བདག་བཀུག་པས་མོད་ལ་མཆིས་ནས་དགོས་པ་ཐམས་ཅད་བསྒྲུབ་པར་བགྱིའོ། །ལས་ཐམས་ཅད་བགྱིའོ།
en: As soon as the homa is offered, I will be summoned and immediately arrive to perform all tasks and activities.

source: །ཇི་སྲིད་འཚོའི་བར་དུ་བསྙེན་བཀུར་བགྱིས་མཆིས་ཤིང་བཀུར་སྟིར་སྤྱད་པར་བགྱིའོ།
en: For as long as I live, I will stand by and perform the duties of an assistant.

source: །བགེགས་དང་ལོག་འདྲེན་དང་། འབྱུང་པོ་དང་གནོད་སྦྱིན་དང་། སྲིན་པོ་ཐམས་ཅད་བཟློག་པར་བགྱིའོ།
en: I will ward off all vighnas, vināyakas, bhūtas, and rākṣasas.’ “

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ལ་དུ་དེ་ལ་རེག་པར་བགྱིས་ན། ནམ་མཁའ་ལ་འཕུར་ནས། རིག་སྔགས་འཆང་གི་རིགས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་འགྱུར་རོ།
en: If the vidyā holder touches the sweetmeats, he will fly up into the sky, where he will visit all the vidyādhara clans.

source: །རིག་སྔགས་འཆང་ཐམས་ཅད་ཀྱི་འཁོར་ལོས་སྒྱུར་བར་འགྱུར་རོ། །རིག་སྔགས་འཆང་གི་འཁོར་ལོས་སྒྱུར་བ་ས་ཡ་ཕྲག་གཉིས་དང་། བྱེ་བ་ཕྲག་བདུན་གྱིས་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ།
en: He will become the great emperor over all vidyādharas and have a retinue of one hundred and eighty millionvidyādhara emperors.

source: །ཚེའི་ཚད་ལྷའི་བསྐལ་པ་དྲུག་ཁྲིར་འགྱུར་རོ། །སྐྲ་ཅུང་ཟད་འཁྱིལ་བར་ཡང་འགྱུར་རོ། །ལ་དུ་ལྷུང་བཟེད་ཀྱི་ནང་དུ་སྩལ་ཏེ། འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་མདུན་དུ་བཞག་ནས། དོན་ཡོད་རྒྱལ་པོའི་ཁྲོ་བོས་དབང་བསྐུར་ཏེ། དེ་ནས་དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་།
en: His hair will become wavy and curly, and his lifespan will increase to sixty thousand celestial eons. “

source: དམངས་རིགས་དང་། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་ཐམས་ཅད་ལ་སྩལ་བར་བགྱིའོ།
en: If the vidyā holder puts the sweetmeats in a dish, places them in front of the painting of Noble Avalokiteśvara, sprinkles them with water incanted with the Amogharāja-krodha, and then hands them out to be eaten by all the mendicants, brahmins, kṣatriyas, vaiśyas, and śūdras, including women, men, boys, and girls, the sweetmeats will not be exhausted but will continuously reappear.

source: །ལོངས་སྤྱོད་དུ་སྩལ་ཀྱང་བས་པར་མི་འགྱུར་གྱི། སླར་ཞིང་འཕེལ་བར་འགྱུར་རོ། །ཇི་སྲིད་དུ་ལྷུང་བཟེད་ན་ལ་དུ་མཆིས་པ་དེ་སྲིད་དུ་འཕེལ་བར་འགྱུར་ཏེ། ཇི་སྲིད་དུ་སྐྱེ་བོ་འབུམ་འབུམ་མང་ཞིང་ཕལ་ཆེ་བར་སྩལ་ཀྱང་།
en: For as long as the sweetmeats are in the dish, they will continue to appear without diminishing, even after being given in generous portions to one hundred thousand people. “

source: གཏུགས་པར་མི་འགྱུར་རོ། །ལ་དུ་ལ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་ལན་བདུན་བཟླས་བརྗོད་བགྱིས་ན། དེའི་འོག་ཏུ་གང་དུ་རེག་པ་དེར་ཡང་གསེར་བཟང་པོར་འགྱུར་རོ།
en: If the vidyā holder incants the sweetmeats seven times with the heart mantra of Amoghapāśa, then anything he touches will turn into celestial gold.

source: །ལ་དུ་ལ་ལན་བདུན་བཟླས་བརྗོད་བགྱིས་ཏེ། ཀླུའི་གནས་སུ་འཕངས་ན་དེའི་ཚེ་རྒྱ་མཚོ་ཆེན་པོ་མཐར་གཏུགས་པའི་ཀླུའི་རྒྱལ་པོ་འཁོར་དང་བཅས་པ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་ཏེ། སྒོ་ན་ཆར་མི་འབབ་པ། བསྒོ་བ་བཞིན་ཆར་འབེབས་པར་བགྱིད་དོ། །ཅི་བསྒོ་བ་བཞིན་བགྱིད་པར་འགྱུར་རོ།
en: If he incants the sweetmeats seven times and throws them into the home of nāgas, all the nāga kings as far away as the distant shores of the ocean, together with their entire retinues, will fall under his thrall and become servants to carry out his orders.

source: །ཧ་ཅང་ཆར་ཆེས་ན་བསྒོ་བ་བཞིན།
en: In the case of a drought, they can be ordered to send rain.

source: ཧ་ཅང་ཆར་ཆེན་པོ་འགུམས་པར་བགྱིད་དོ།
en: In the case of excessive rainfall, they can be ordered to stop the rain.

source: །རླུང་དང་། གྲང་བ་དང་། ཚ་བ་དང་། སེར་བ་ཐམས་ཅད་བསྒོ་བ་ཙམ་གྱིས་གཅོད་པར་བགྱིད་དོ།
en: They will stop hurricanes, cold spells, heat waves, and thunderstorms at his command. “

source: །ཕུག་གི་སྒོར་ལ་དུ་ལ་ལན་བདུན་བཟླས་བརྗོད་བགྱིས་ནས། ཕུག་གི་སྒོར་བསྣུན་ན་ཕུག་གི་སྒོ་ཐམས་ཅད་འབྱེ་བར་འགྱུར་རོ། །འཁྲུལ་འཁོར་དང་གཏན་པ་དང་། སྒོ་གླེགས་ཐམས་ཅད་དུམ་བུར་བཅག་པར་འགྱུར་རོ། །གནས་ན་གནས་པ་ཐམས་ཅད་ཕྱིར་བྱུང་ནས།
en: If the vidyā holder incants the sweetmeats seven times near openings in the earth and smashes them on the entrances, the doors will all fall open; all locks, bolts, and door panels will break, and the inhabitants of the dwellings will all come out and stand before the vidyā holder, ready to carry out his orders.

source: རིག་སྔགས་འཆང་གི་མདུན་དུ་མཆིས་ཏེ། བསྒོ་བ་བཞིན་དུ་བགྱིད་པར་འགྱུར་རོ། །ནགས་ཚང་ཚིང་གི་དབུས་སུ་འཕངས་ན། ནགས་ཚང་ཚིང་གི་གནས་ཀྱི་སྒོ་ཐམས་ཅད་ཕྱེ་ནས་སྨན་གྱི་རྫས་ཐམས་ཅད་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་མཆིས་པར་འགྱུར་རོ།
en: If the sweetmeats are cast into the entrance of a deep forest, the doors to the dwellings in the forest will open, and all the medicinal substances and herbs will appear before the vidyā holder in their own respective forms. “

source: །ལ་དུ་ལ་ལན་བདུན་བཟླས་བརྗོད་བགྱིས་ཏེ། དུར་ཁྲོད་ཆེན་པོའི་དབུས་སུ་འཕངས་ན་འབྱུང་པོ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་བཅས་པའི་གནས་ཀྱི་སྒོ་ཐམས་ཅད་འབྱེ་བར་འགྱུར་རོ། །གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་བ་ཐམས་ཅད་སྒྲེན་མོར་གྱུར་ན།
en: If the vidyā holder incants the sweetmeats seven times and casts them into the middle of a vast charnel ground, the doors to the houses of all the bhūtas, yakṣas, and rākṣasas who dwell there will fall open, and all the yakṣas, rākṣasas, and bhūtas will become naked.

source: ཐམས་ཅད་དབང་དུ་མཆིས་པར་འགྱུར་ཞིང་། ཇི་སྲིད་འཚོའི་བར་དུ་བསྒོ་བ་བཞིན་མཆིས་པར་འགྱུར་རོ།
en: All of them will remain in the vidyā holder’s thrall and attend upon him for as long as they live. “

source: །རྨ་མ་བྱུང་བའི་མི་རོ་ལ། དྲི་ཆབ་ཀྱིས་ཁྲུས་བགྱིས་ལ་ལ་དུ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ཏེ། ལག་པ་གཉིས་སུ་ལ་དུ་སྩལ་ལ།
en: The vidyā holder should wash an untouched corpse in scented water, then incant a sweetmeat twenty-one times and place it in its hands.

source: གོས་དཀར་པོས་རོ་གཡོགས་ནས། ཁྲོ་བོའི་རྒྱལ་པོ་ཆབ་དང་ཡུངས་ཀར་ལ་ལན་བདུན་བཟླས་ནས་དབང་བསྐུར་ན་ཅི་དྲིས་པ་དེ་དག་ཐམས་ཅད་སྨྲ་བར་འགྱུར་ཏེ། བདེ་བ་དང་ལོ་ལེགས་པ་དང་། ལོ་ནོངས་པ་དང་། ནད་དང་། གནོད་པ་དང་། འཚེ་བ་དང་།
en: He should wrap the corpse in white cloth and sprinkle it with water and mustard incanted seven times with the Krodharāja mantra.

source: ཕ་རོལ་གྱི་དཔུང་དང་། ཕས་ཀྱི་དགྲ་བོ་དང་། མི་མཛའ་བའི་འཇིགས་པ་དང་། མི་ངས་དང་། ཡམས་ཀྱི་ནད་དེ་དག་ཐམས་ཅད་སྨྲ་བར་འགྱུར་རོ།
en: It will tell the vidyā everything he wants to know about contentment, prosperity, poverty, diseases, misfortunes, calamities, dangers from foreign armies, opponents, and adversaries, as well as about pestilence and plague.

source: །ལྷའི་འཇིག་རྟེན་དུ་སྐྱེ་བའམ། སངས་རྒྱས་ཀྱི་ཞིང་དུ་སྐྱེ་བ་སྨྲ་བར་འགྱུར་ཞིང་། དམྱལ་བར་སྐྱེ་བ་སྨྲ་བར་འགྱུར་རོ།
en: It will foretell his rebirth in a deva realm, a buddha field, or a hell.

source: །ཚེ་རིང་བའམ་ཚེ་ཐུང་བ་སྨྲ་བར་འགྱུར་རོ། །དུས་མ་ལགས་པའི་འཆི་བ་སྨྲ་བར་འགྱུར་རོ།
en: It will tell him whether his lifespan will be short or long, and it will foretell an untimely death.

source: །གཏེར་གྱི་གཏམ་སྨྲ་བར་འགྱུར་ཏེ། ནོར་བསྒྱུར་བའི་གཏམ་མམ། ཞིང་གི་གཏམ་མམ། མིག་འཕྲུལ་གྱི་གཏམ་སྨྲ་བར་འགྱུར་རོ། །ཆོ་ག་ཞིབ་མོ་འགྲུབ་པ་དང་།
en: It will tell him about finding a treasure and about alchemical processes, give him farming advice, and tell him the secrets of magic.

source: གསང་སྔགས་འགྲུབ་པ་དང་། ཕྱག་རྒྱའི་དཀྱིལ་འཁོར་འགྲུབ་པ་སྨྲ་བར་འགྱུར་རོ།
en: It will explain how to accomplish a rite, a mantra, a mudrā, or a maṇḍala.

source: །མིག་སྨན་འགྲུབ་པ་དང་རིལ་བུ་འགྲུབ་པ་སྨྲ་བར་འགྱུར་རོ།
en: It will teach him about applying magic ointments and making magic pills.

source: །ནམ་མཁའ་ལ་མཆི་བ་དང་། མི་གདའ་བར་བགྱི་བ་དང་། རོ་ལངས་བསླང་བ་དང་། རིགས་མ་དག་པ་དང་། དགྲ་ཆད་པས་བཅད་ཅིང་དབང་དུ་བགྱི་བ་དེ་དག་ཐམས་ཅད་སྨྲ་བར་འགྱུར་རོ།
en: It will teach him everything about moving through the air, becoming invisible, animating corpses by summoning a vetāla, soothing fevers, subduing enemies, or enthralling someone.

source: །སྒྱུ་ཐབས་སྨྲ་བར་འགྱུར་རོ།
en: It will teach him useful skills and how to increase or diminish something.

source: །ཉམས་པ་སྨྲ་བར་འགྱུར་རོ། །འཕེལ་བ་སྨྲ་བར་འགྱུར་བ་ནས་བསྐལ་པ་ལས་འདས་པའི་འདས་པ་དང་། མ་འོངས་པའི་དང་། ད་ལྟར་བྱུང་བའི་བར་དུ་སྨྲ་བར་འགྱུར་རོ།
en: And it will describe this entire eon, past, present, and future.

source: །དེ་ནས་རིག་སྔགས་འཆང་གིས་ཆབ་ཀྱི་ཁར་སྩལ་ལ་ལ་དུ་བླངས་ན་རོ་འགྱེལ་བར་འགྱུར་རོ།
en: After this, the vidyā holder should splash water on the corpse’s face and remove the sweetmeat from its hands; the corpse will then collapse. “

source: །ལ་དུ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ནས། རྒྱལ་པོའི་སྒོར་བསྣུན་ན། རྒྱལ་པོའི་བཙུན་མོ་འཁོར་དང་བཅས་པ་བདག་ཉིད་དམ། ནོར་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: If the vidyā holder incants a sweetmeat twenty-one times and places it at the gate to a royal palace, the king, harem, and retinue will remain under the vidyā holder’s thrall and place themselves and their wealth at his disposal.

source: །གྲོང་ཁྱེར་གྱི་སྒོར་བསྣུན་ན། གྲོང་ཁྱེར་ན་གནས་པའི་སྐྱེས་པའམ། བུད་མེད་དམ། ཁྱེའུ་དང་བུ་མོ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་ཞིང་།
en: If he places the sweetmeat at a city gate, all its inhabitants—women, men, boys, and girls—will fall under his thrall.

source: ནོར་ཆེན་པོ་འདུ་བ་འགྲུབ་པ་ཐོབ་པར་འགྱུར་རོ།
en: He will come to be revered and will be a master of amassing wealth. “

source: །མཆོད་པའི་གནས་ཆེན་པོར་འགྱུར་རོ། །ལ་དུ་ལ་ལན་བདུན་བཟླས་བརྗོད་བགྱིས་ཏེ། དཔལ་ལྷ་མོ་ཆེན་མོའི་ལག་པར་སྩལ་ན། དཔལ་ལྷ་མོ་ཆེན་མོ་དབང་དུ་གྱུར་ནས།
en: If he incants a sweetmeat seven times and places it in the hands of the statue of the great goddess Śrī, Śrī will fall under his thrall and will grant him great wealth.

source: ནོར་ཆེན་པོ་སྩོལ་ཅིང་ཇི་སྲིད་འཚོའི་བར་དུ་མཆིས་པར་འགྱུར་རོ།
en: She will attend upon him for as long as he lives. “

source: །ལ་དུ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས། ཁུག་མའི་ནང་དུ་སྩལ་ཏེ། མཆན་ཁུང་དུ་བསྲེལ་བར་བགྱིས་ཏེ། ཅི་ཙམ་དུ་བསྲེལ་བ་དེ་སྲིད་དུ་མི་གདའ་བར་གྱུར་ནས། གང་དུ་སྩལ་བ་དེར་འཇུག་པར་འགྱུར་རོ།
en: If he incants the sweetmeat one hundred and eight times, places it in a pouch, and keeps it under his arm, he will remain invisible for as long as he keeps it there, and he will be able to enter any place he wants. “

source: །གང་ན་ཤིང་གཅིག་པའམ། འབབ་ཆུ་གཅིག་པར་ལ་དུ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ། དབང་བསྐུར་ནས་ཤིང་གི་དྲུང་དུ་བརྡེགས་ན།
en: If he incants the sweetmeat twenty-one times by a lonely tree next to a stream and places it at the root of the tree, he will enthrall all beautiful shapeshifting women.

source: འདོད་དགུར་སྒྱུར་བ་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ། །ཅི་ལྟར་བསམས་པའི་འདོད་པ་ཐམས་ཅད་ཉེ་བར་མཆིས་ནས་ཡོངས་སུ་སྤྱོད་པ་དང་། ཇི་སྲིད་འཚོའི་བར་དུ་མཆིས་པར་འགྱུར་རོ། །ལ་དུ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བགྱིས་ཏེ།
en: They will provide every pleasure and offer every service depending on his wish, and they will serve him for as long as he lives. “

source: མ་མོའི་གནས་སུ་ནག་པོ་ཆེན་པོའི་སྤྱི་བོའི་གཙུག་ཏུ་བཞག་ལ། ཁྲོ་བོའི་རྒྱལ་པོ་ལན་བདུན་བཟླས་ཏེ། ཆབ་དང་ཡུངས་ཀར་གྱིས་དབང་བསྐུར་བ་བགྱིས་ན། དེ་ནས་སྦྱོར་བ་མོ་ཐམས་ཅད་དང་། མཁའ་འགྲོ་མ་ཐམས་ཅད་དབང་དུ་གྱུར་ནས་མངག་གཞུག་པ་ལས་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: If he incants the sweetmeat twenty-one times, places it on the head of Mahākāla in a place sacred to the mātṛs, and sprinkles the sweetmeat with water and mustard seeds incanted seven times with the Krodharāja mantra, all yoginīs and ḍākinīs will fall under his thrall and attend upon him as servants to carry out all his tasks.

source: །ལ་དུ་ལ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ། ནག་པོ་ཆེན་པོའི་ལྟེ་བའི་ཕྱོགས་སུ་བཞག་ན་མ་མོའི་ཚོགས་ཐམས་ཅད་རང་གི་གཟུགས་ཀྱིས་མདུན་དུ་མཆིས་ནས། མཆོག་ཐམས་ཅད་སྩོལ་བར་འགྱུར་རོ། །ལས་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: If the vidyā holder incants a sweetmeat twenty-one times and places it in at Mahākāla’s navel, the entire host of mātṛs will appear before him in their respective forms, grant him every boon, and perform all tasks. “

source: །ལ་དུ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ནས། འཕགས་པ་འཇམ་དཔལ་གྱི་ལྷུང་བཟེད་ཀྱི་ནང་དུ་སྩལ་ཏེ། ཁྲོ་བོའི་རྒྱལ་པོས་དབང་བསྐུར་བགྱིས་ན། ཇི་སྲིད་དུ་ལྷུང་བཟེད་ན་ལ་དུ་མཆིས་པ་དེ་སྲིད་དུ་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱན་སྔར། ལྷའི་ཞལ་ཟས་རོ་སྣ་ཚོགས་ཀྱི་རོའི་མཆོག་དང་ལྡན་པ་དག་འབྱུང་བར་འགྱུར་ཞིང་།
en: If he incants the sweetmeat one hundred and eight times, places it in Mañjuśrī’s alms bowl, and sprinkles it with water incanted with the Krodharāja mantra, various foods of the best flavors that afford divine pleasure will appear before all the tathāgatas in the ten directions.

source: ཉན་ཐོས་དང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཆེན་པོ་དང་བཅས་པ་ཚིམ་པར་བགྱིས་པར་འགྱུར་རོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་དང་།
en: For as long as the sweetmeat remains in the bowl, the tathāgatas together with all the śrāvakas and bodhisattvas in the great assemblies will become fully sated.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་རིག་སྔགས་འཆང་དེའི་ཡོན་སྦྱོང་བ་མཛད་པར་འགྱུར་རོ།
en: All these tathāgatas, the hosts of bodhisattvas, and the congregation of śrāvakas will purify the vidyā holder’s gift. “

source: །ལ་དུ་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་བརྗོད་བགྱིས་ཏེ།
en: The vidyā holder should incant the sweetmeat one hundred and eight times and consecrate it with the Krodharāja mantra.

source: ཁྲོ་བོའི་རྒྱལ་པོའི་དབང་བསྐུར་ལ། ལྕགས་ཀྱུའི་རྒྱལ་པོས་ཆབ་ལ་བཟླས་བརྗོད་བགྱིས་ནས། མེ་ཐབ་ཀྱི་མཚམས་བཅིང་བར་བགྱིའོ།
en: He should then incant water with the Aṅkuśarāja mantra and use it to demarcate the border of the fire pit.

source: །དེ་ནས་ཨ་རྐའི་ཡམ་སྲེག་ཤིང་གི་མེ་སྦར་ལ། ལ་དུ་དེ་མེ་ཐབ་ཀྱི་དབུས་སུ་བཞག་སྟེ།
en: He should light a fire using sticks of giant milkweed and place the sweetmeat in the middle of the fire pit.

source: མར་དང་ཡུངས་ཀར་དང་ཞོ་དང་སྦྲང་རྩི་བསྲེས་ལ་ལན་བརྒྱ་རྩ་བརྒྱད་སྦྱིན་སྲེག་བགྱིའོ།
en: He should then make one hundred and eight offerings of ghee and mustard seeds smeared with curds and honey into the fire.

source: །ལན་བརྒྱ་རྩ་བརྒྱད་ཚང་བ་དང་། མེ་ལྷ་མེའི་རང་བཞིན་གྱི་གཟུགས་ཀྱིས་བྱུང་ནས། རིག་སྔགས་འཆང་ལ་སྨྲས་པ།
en: When he has reached the number one hundred and eight, the god of fire will appear in person before the vidyā holder and say, ‘Good!

source: །བདག་ཚིམ་པར་བྱས་སོ། །བདག་དགའ་བར་གྱུར་ཏོ།
en: I am sated and overjoyed.

source: །རིག་སྔགས་འཆང་བདག་གིས་མཆོག་ཏུ་དགའ་བ་ཐོབ་ཀྱིས་རིག་སྔགས་འཆང་ཅི་ལྟར་ཡིད་ལ་བསམས་པ་བཞིན་འདོད་པ་སྨྲོས་ཤིག་དང་། མཆོག་སྦྱིན་ནོ།
en: I obtained the highest happiness. Please tell me, vidyā holder, what your heart desires, and I will grant it.’ “

source: །རིག་སྔགས་འཆང་གིས་ཇི་ལྟར་ཡིད་ལ་བསམས་པ་བཞིན་མཆོག་བརྗོད་པར་བགྱིའོ། །མེ་ལྷ་དེས་ཡང་ཐམས་ཅད་སྩོལ་ཅིང་དབང་དུ་གྱུར་ནས་མཆིས་པར་འགྱུར་རོ།
en: The vidyā holder should then tell him what boons he desires, and the god of fire will grant them all.

source: །ལས་ཐམས་ཅད་གྲུབ་པ་སྩོལ་བར་འགྱུར་རོ།
en: He will remain in the vidyā holder’s thrall and will serve him, enabling him to accomplish all his activities.

source: །མེའི་ཕུང་པོའི་དབུས་སུ་ཞུགས་ནས་འོད་ཟེར་སྟོང་འཕྲོ་བ་རྣམས་གངས་བཞིན་དུ་བསིལ་བར་འགྱུར་ཏེ། ཆབ་ནས་འབྱུང་བ་བཞིན་ནོ།
en: The vidyā holder will be able to enter and exit a great mass of fire with thousands of blazing flames as if it were water, and it will feel as cool as snow-covered mountains.

source: །ལག་པས་མེ་རྣམས་ཚུགས་པར་བགྱིད་དོ། །འབར་བཞིན་དུ་ཀླད་པའི་སྤྱི་བོར་བཞག་ན། སྐྲ་ཉག་མ་གཅིག་ཀྱང་འཚིག་པར་མི་བགྱིད་དེ།
en: Touching the fire lightly with his hand, he will be able to place its blazing mass on his head, and not a single hair will be singed or affected by the fire in any way.

source: མེའི་དབང་དུ་མཆི་བར་མི་འགྱུར་རོ། །འབར་བཞིན་དུ་གཡར་གྱི་ནང་དུ་བསྲེ་ལན་ཅུང་ཟད་དྲོ་བ་ཙམ་དུ་ཡང་མི་འགྱུར་རོ། །ལུས་ལ་བབ་ན་ཅི་ལྟར་ཙནྡན་བཞིན་དུ་བསིལ་ཞིང་བདེ་བར་འགྱུར་རོ།
en: He will be able to carry fire in his mouth and not feel any of its heat, and if fire touches his body, the vidyā holder will feel refreshed as if by sandalwood balm.

source: །གཞན་ཡང་དགོས་པ་སྣ་ཚོགས་བགྱིད་པར་འགྱུར་རོ།
en: The god of fire will perform all kinds of deeds for him. “

source: །གོས་ཀྱི་མཐའ་མར་ཐུམ་པོ་བགྱིས་ན་ཚིག་པར་མི་འགྱུར་རོ། །ཆབ་ཀྱི་ནང་དུ་སྩལ་ན་འགུམ་པར་མི་འགྱུར་རོ།
en: Fire will not burn the vidyā holder’s clothes if they comes into contact with it, and if the vidyā holder places fire beneath water, the fire will not go out.

source: །སྦྱིན་སྲེག་ཐམས་ཅད་ཀྱི་ཆོ་ག་སོ་སོའི་གཟུགས་སུ་མཆིས་པར་འགྱུར་རོ། །ཐམས་ཅད་དུ་དགོས་པ་གྲུབ་པ་སྩོལ་བར་འགྱུར་རོ།
en: The god of fire will attend upon the vidyā holder in person during all homa procedures and will successfully complete any tasks he is given, wherever they may take him.

source: །དགོས་པ་གང་དང་གང་དུ་བསྐོས་པ་དེ་དང་དེར་དགོས་པ་ཐམས་ཅད་གྲུབ་པ་སྩོལ་བར་འགྱུར་རོ། །ཐམས་ཅད་དུ་གསང་སྔགས་དང་དཀྱིལ་འཁོར་དང་ཆོ་ག་གྲུབ་པ་ཐམས་ཅད་ལུང་འབོག་པར་འགྱུར་རོ།
en: He will always instruct him in all successful uses of every mantra and maṇḍala.

source: །དུ་བ་དང་རླུང་དང་མེ་འབར་བའི་ཤུགས་ཀྱིས་དཔག་ཚད་སྟོང་དུ་མཆིས་ཤིང་སླར་ཡང་ལྡོག་པར་འགྱུར་རོ།
en: He can travel a thousand leagues and back again, propelled by smoke, wind, cloud, and flame.

source: །དགོས་པ་ཐམས་ཅད་ཉེ་བར་སྟོན་པར་འགྱུར་རོ། །དགོས་པ་ཐམས་ཅད་བགྱིད་པར་འགྱུར་རོ།
en: He will indicate what needs to be done and will do all of it.

source: །ཐམས་ཅད་དུ་གྲུབ་པ་སྩོལ་བར་འགྱུར་རོ།
en: He will ensure success in all things. “
